# running in formal/counter/src/
read_verilog -sv -D FORMAL counter.sv
prep -top counter
hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
